// * 선택정렬 (선택한 값을 나머지 전부 비교)
let a = [10, 11, 9, 2, 3, 6, 5, 4];
let 정렬된배열 = [];

for (let i = 0; i < 8; i++) {
  정렬된배열.push(Math.min.apply(null, a));
  a.splice(a.indexOf(Math.min.apply(null, a)), 1);
  console.log(a);
  console.log(정렬된배열);
}

// * 삽입정렬 (알아서 밀어내기)
let 입력값 = [5, 10, 66, 77, 54, 32, 11, 15];
let 정렬된배열2 = [];
let 배열의길이 = 입력값.length;
console.log(배열의길이);

function 삽입값이들어갈인덱스(정렬된배열2, 삽입값) {
  for (let i in 정렬된배열2) {
    if (삽입값 < 정렬된배열2[i]) {
      return i;
    }
  }
  return 정렬된배열2.length;
}

for (let i = 0; i < 배열의길이; i++) {
  삽입값 = 입력값.shift();
  인덱스 = 삽입값이들어갈인덱스(정렬된배열2, 삽입값);
  정렬된배열2.splice(인덱스, 0, 삽입값);
  console.log(`인덱스: ${인덱스}`);
  console.log(`정렬된배열: ${정렬된배열2}`);
}

// * 병합정렬
let 입력값2 = [5, 10, 66, 77, 54, 32, 11, 15];
// 분할
// [5, 10, 66, 77], [54, 32, 11, 15]
// [5, 10], [66, 77], [54, 32], [11, 15]
// [5], [10], [66], [77], [54], [32], [11], [15]
// 정복
// [5, 10], [66, 77], [32, 54], [11, 15]
// [5, 10, 66, 77], [11, 15, 32, 54]
// [5, 10, 11, 15, 32, 54, 66, 77]

// * 퀵정렬
